# ImportDXFDWGFile

## Description
Import specific DXF/DWG file

```pascal
FUNCTION ImportDXFDWGFile(
				fileName : DYNARRAY[] of CHAR;
				isBatch  : BOOLEAN) : INTEGER;
```

```python

def vs.ImportDXFDWGFile(fileName, isBatch):
    return INTEGER
```

## Parameters
|Name|Type|Description|
|---|---|---|
|fileName|DYNARRAY[] of CHAR||
|isBatch|BOOLEAN||

## Version
Availability: from Vectorworks 2013
## Category
* ImportExport